podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/3.stage3Folder/peripherals/TSI_MKE15Z7.svd.xml
            <register>
               <name>SINC</name>
               <description>TSI SINC filter Register</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x70001</resetValue>
               <fields>
                  <field>
                     <name>SSC_CONTROL_OUT</name>
                     <description>SSC_CONTROL_OUT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SSC output value is 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SSC output value is 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SINC_VALID</name>
                     <description>SINC_VALID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SINC filter is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SINC filter is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SINC_OVERFLOW_FLAG</name>
                     <description>SINC_OVERFLOW_FLAG</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The counter result has no overflow occurence in the last scan process</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The counter result has an overflow occurence in the last scan process</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWITCH_ENABLE</name>
                     <description>SWITCH_ENABLE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SSC function is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SSC function is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DECIMATION</name>
                     <description>DECIMATION</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00000</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 1 scan period</description>
                           <value>0b00000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00001</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 2 scan periods</description>
                           <value>0b00001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00010</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 3 scan periods</description>
                           <value>0b00010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00011</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 4 scan periods</description>
                           <value>0b00011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00100</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 5 scan periods</description>
                           <value>0b00100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00101</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 6 scan periods</description>
                           <value>0b00101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00110</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 7 scan periods</description>
                           <value>0b00110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00111</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 8 scan periods</description>
                           <value>0b00111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01000</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 9 scan periods</description>
                           <value>0b01000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01001</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 10 scan periods</description>
                           <value>0b01001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01010</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 11 scan periods</description>
                           <value>0b01010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01011</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 12 scan periods</description>
                           <value>0b01011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01100</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 13 scan periods</description>
                           <value>0b01100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01101</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 14 scan periods</description>
                           <value>0b01101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01110</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 15 scan periods</description>
                           <value>0b01110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01111</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 16 scan periods</description>
                           <value>0b01111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10000</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 17 scan periods</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10001</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 18 scan periods</description>
                           <value>0b10001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10010</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 19 scan periods</description>
                           <value>0b10010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10011</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 20 scan periods</description>
                           <value>0b10011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10100</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 21 scan periods</description>
                           <value>0b10100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10101</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 22 scan periods</description>
                           <value>0b10101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10110</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 23 scan periods</description>
                           <value>0b10110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10111</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 24 scan periods</description>
                           <value>0b10111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11000</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 25 scan periods</description>
                           <value>0b11000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11001</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 26 scan periods</description>
                           <value>0b11001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11010</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 27 scan periods</description>
                           <value>0b11010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11011</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 28 scan periods</description>
                           <value>0b11011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11100</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 29 scan periods</description>
                           <value>0b11100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11101</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 30 scan periods</description>
                           <value>0b11101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11110</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 31 scan periods</description>
                           <value>0b11110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11111</name>
                           <description>The TSI_DATA[TSICNT] bits is the counter value of 32 scan periods</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ORDER</name>
                     <description>ORDER</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Using 1 order sinc filter</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Using 2 order sinc filter</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CUTOFF</name>
                     <description>CUTOFF</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>div=1</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>div=2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>div=4</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>div=8</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>div=16</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>div=32</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>div=64</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>div=128</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>NC</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>NC</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>NC</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>NC</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>NC</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>NC</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>NC</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>NC</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
